Repository: pifu74/IPv6PrefixHelper
Catalog: IPv6PrefixHelper/*.lproj/Localizable.strings
Languages: de

# status.initial
source: Status: no check performed yet.
de: Status: Es wurde noch keine Prüfung durchgeführt.

# status.ulaOnly
source: Status: only ULA addresses present – prefix likely lost, IPv6 internet unreachable.
de: Status: Nur ULA‑Adressen vorhanden – vermutlich verlorenes Präfix, IPv6‑Internet nicht erreichbar.

# status.noGlobalIPv6
source: Status: no global IPv6 address configured.
de: Status: Es ist keine globale IPv6‑Adresse konfiguriert.

# status.noDefaultRoute
source: Status: error – IPv6 default route missing (suspected RA silence).
de: Status: Fehler – IPv6‑Standardroute fehlt (vermutete RA‑Stille).

# status.prefixMismatch
source: Status: warning – IPv6 prefixes for Wi‑Fi and Ethernet do not match.
de: Status: Warnung – Die IPv6‑Präfixe von WLAN und Ethernet stimmen nicht überein.

# status.ipv6Dead
source: Status: error – prefix likely stale, IPv6 connection not reachable.
de: Status: Fehler – Präfix vermutlich veraltet, IPv6‑Verbindung nicht erreichbar.

# status.ok
source: Status: connection OK – IPv6 prefixes match.
de: Status: Verbindung in Ordnung – Die IPv6‑Präfixe stimmen überein.

# WLAN (en1): %@
source: Wi‑Fi (en1): %@
de: WLAN (en1): %@

# WLAN (en1): – keine globale IPv6-Adresse –
source: Wi‑Fi (en1): – no global IPv6 address –
de: WLAN (en1): – keine globale IPv6-Adresse –

# Ethernet (en0): – keine globale IPv6-Adresse –
source: Ethernet (en0): – no global IPv6 address –
de: Ethernet (en0): – keine globale IPv6-Adresse –

# Letzte Prüfung: %@
source: Last check: %@
de: Letzte Prüfung: %@

# Letzte Prüfung: noch keine
source: Last check: none yet
de: Letzte Prüfung: noch keine

# Letzter Fix: %@
source: Last fix: %@
de: Letzter Fix: %@

# Letzter Fix: noch keiner
source: Last fix: none yet
de: Letzter Fix: noch keiner

# Status prüfen
source: Check status
de: Status prüfen

# Einstellungen …
source: Settings…
de: Einstellungen …

# Log anzeigen …
source: Show log…
de: Log anzeigen …

# Über „IPv6 Prefix Fixer“…
source: About "IPv6 Prefix Fixer"…
de: Über „IPv6 Prefix Fixer“…

# App beenden
source: Quit app
de: App beenden

# Allgemein
source: General
de: Allgemein

# Periodische Auto-Prüfung alle 5 Minuten aktivieren
source: Enable periodic auto check every 5 minutes
de: Periodische Auto-Prüfung alle 5 Minuten aktivieren

# Automatisch IPv6 bei Fehler reparieren
source: Automatically repair IPv6 on failure
de: Automatisch IPv6 bei Fehler reparieren

# Darstellung
source: Appearance
de: Darstellung

# App im Dock anzeigen
source: Show app in Dock
de: App im Dock anzeigen

# Anzeigemodus
source: Display mode
de: Anzeigemodus

# Hell
source: Light
de: Hell

# Dunkel
source: Dark
de: Dunkel

# Debug-Logging (Konsole)
source: Debug logging (console)
de: Debug-Logging (Konsole)

# Exportieren …
source: Export…
de: Exportieren …

# Leeren
source: Clear
de: Leeren

# Log exportieren
source: Export log
de: Log exportieren

# log.nwPathMonitor.change
source: Network status changed: %@
de: Netzwerkstatus geändert: %@

# log.nwPathMonitor.skip
source: Network status changed: automatic check skipped (status ≠ satisfied).
de: Netzwerkstatus geändert: automatische Prüfung übersprungen (Status ≠ satisfied).

# log.prefix.firstObserved
source: First detected IPv6 prefix: %@
de: Erstes erkanntes IPv6‑Präfix: %@

# log.prefix.changed
source: IPv6 prefix changed: %@ → %@
de: IPv6‑Präfix geändert: %@ → %@

# log.prefix.lost
source: Global IPv6 prefix lost – no global address remaining.
de: Globales IPv6‑Präfix verloren – keine globale Adresse mehr vorhanden.

# log.route.current
source: Current IPv6 default route: gateway=%@, interface=%@
de: Aktuelle IPv6‑Standardroute: Gateway=%@, Schnittstelle=%@

# log.autofix.start
source: Automatic repair executed.
de: Automatische Reparatur ausgeführt.

# log.autofix.routerKnown
source: Automatic repair: using stored IPv6 router for "Ethernet".
de: Automatische Reparatur: gespeicherten IPv6‑Router für „Ethernet“ verwendet.

# log.autofix.noPrefix
source: Automatic repair: no Wi‑Fi prefix or known router – IPv6 for "Ethernet" set to automatic.
de: Automatische Reparatur: kein WLAN‑Präfix oder bekannter Router – IPv6 für „Ethernet“ auf automatisch gesetzt.

# log.autofix.noRouter
source: Automatic repair: no known IPv6 router – IPv6 for "Ethernet" set to automatic.
de: Automatische Reparatur: kein bekannter IPv6‑Router – IPv6 für „Ethernet“ auf automatisch gesetzt.

# log.autofix.setManual
source: "Ethernet" has been set to manual IPv6 mode (address %@/64, router %@).
de: „Ethernet“ wurde auf manuellen IPv6‑Modus gesetzt (Adresse %@/64, Router %@).

# log.autofix.setAutomatic
source: "Ethernet" has been set to automatic IPv6 mode.
de: „Ethernet“ wurde auf automatischen IPv6‑Modus gesetzt.

# log.health.httpError
source: Health check (HTTP error): ping6 dns.google → %@
de: Health‑Check (HTTP‑Fehler): ping6 dns.google → %@

# log.check.start
source: Status check started (autoFix=%@).
de: Statusprüfung gestartet (autoFix=%@)

# log.ipv6.testTarget
source: Testing IPv6 target %@ (%@)…
de: Prüfe IPv6‑Ziel %@ (%@) …

# log.ipv6.testResult
source: Result for %@: %@
de: Ergebnis für %@: %@

# log.ipv6.testTimeout
source: IPv6 test %@: error – timeout after %d seconds
de: IPv6‑Test %@: Fehler – Timeout nach %d Sekunden

# log.ipv6.allGood
source: All IPv6 targets reachable successfully.
de: Alle IPv6‑Ziele erfolgreich erreichbar.

# log.init.firstCheck
source: Initialization complete – first automatic check will start in %0.0f seconds (auto-fix enabled).
de: Initialisierung abgeschlossen – erste automatische Prüfung startet in %0.0f Sekunden (Auto-Fix aktiviert).

# log.netstatus.ok
source: Network status: connection OK.
de: Netzwerkstatus: Verbindung in Ordnung.

# log.netstatus.changed
source: Network status changed: %@
de: Netzwerkstatus geändert: %@

# log.checkStatus.start
source: Status check started (auto-fix: %@).
de: Statusprüfung gestartet (Auto‑Fix: %@).

# log.found.ipv6
source: Discovered global IPv6 addresses – Wi‑Fi: %@, Ethernet: %@.
de: Gefundene globale IPv6‑Adressen – WLAN: %@, Ethernet: %@.

# log.found.ula
source: Discovered ULA addresses – Wi‑Fi: %@, Ethernet: %@.
de: Gefundene ULA‑Adressen – WLAN: %@, Ethernet: %@.

# log.found.ipv4
source: Discovered IPv4 addresses – Wi‑Fi: %@, Ethernet: %@.
de: Gefundene IPv4‑Adressen – WLAN: %@, Ethernet: %@.

# log.prefixes
source: Detected IPv6 prefixes – Wi‑Fi: %@, Ethernet: %@.
de: Ermittelte IPv6‑Präfixe – WLAN: %@, Ethernet: %@.

# log.ipv6test.start
source: Testing IPv6 target %@ (%@)…
de: Prüfe IPv6‑Ziel %@ (%@)…

# log.ipv6test.result
source: Result for %@: %@
de: Ergebnis für %@: %@

# log.ipv6test.allOk
source: All configured IPv6 targets are reachable.
de: Alle konfigurierten IPv6‑Ziele sind erfolgreich erreichbar.

# log.ipv6.connectivity
source: IPv6 connectivity: %@.
de: IPv6‑Konnektivität: %@.

# log.defaultRoute.current
source: Current IPv6 default route – gateway: %@, interface: %@.
de: Aktuelle IPv6‑Standardroute – Gateway: %@, Schnittstelle: %@.

# log.netstatus.nok
source: Network status: no connection.
de: Netzwerkstatus: Keine Verbindung.

# log.netstatus.requiresConnection
source: Network status: requires connection.
de: Netzwerkstatus: Verbindung wird benötigt.

# log.netstatus.unknown
source: Network status: unknown status (%@).
de: Netzwerkstatus: Unbekannter Status (%@).

# log.netstatus.noAutoCheck
source: Network status changed – skipping automatic check (status ≠ satisfied).
de: Netzwerkstatus geändert: automatische Prüfung übersprungen (Status ≠ satisfied).

# log.autoFix.ulaOnly
source: Only ULA addresses present – assuming lost prefix, running auto-fix.
de: Nur ULA-Adressen gefunden – vermute verlorenes Präfix, Auto-Fix wird ausgeführt.

# log.error.noDefaultRoute.autofix
source: ERROR: IPv6 default route missing – router advertisements (RA) appear to be silent; running auto-fix.
de: FEHLER: IPv6-Standardroute fehlt – vermute RA-Stille, Auto-Fix wird ausgeführt.

# log.error.noDefaultRoute.noAutofix
source: ERROR: IPv6 default route missing – router advertisements (RA) appear to be silent; auto-fix is disabled.
de: FEHLER: IPv6-Standardroute fehlt – vermute RA-Stille, Auto-Fix ist deaktiviert.

# log.autoFix.prefixMismatch
source: Prefix mismatch detected – running auto-fix on Ethernet.
de: Präfix-Mismatch erkannt – Auto-Fix für „Ethernet“ wird ausgeführt.

# log.autoFix.ipv6Dead
source: IPv6 not reachable even though prefixes match – running auto-fix on Ethernet.
de: IPv6 trotz gleicher Präfixe nicht erreichbar – Auto-Fix für „Ethernet“ wird ausgeführt.

# log.autoFix.usedKnownRouter
source: Auto-fix: using stored IPv6 router for 'Ethernet'.
de: Auto-Fix: gespeicherten IPv6-Router für „Ethernet“ verwendet.

# log.autoFix.manualAddress
source: Manual IPv6 configuration: address %@/64, router %@.
de: Manuelle IPv6-Adresse %@/64, Router %@.

# log.autoFix.modeManual
source: IPv6 for 'Ethernet' set to MANUAL (%@/64, router %@).
de: IPv6 für „Ethernet“ auf MANUELL gesetzt (%@/64, Router %@).

# log.autoFix.noPrefixFallbackAuto
source: Auto-fix: no Wi‑Fi prefix and no known router – resetting IPv6 for 'Ethernet' to automatic.
de: Auto-Fix: kein WLAN-Präfix und kein bekannter Router – IPv6 für „Ethernet“ wieder auf automatisch gesetzt.

# log.autoFix.noKnownRouterFallbackAuto
source: Auto-fix: no known IPv6 router – resetting IPv6 for 'Ethernet' to automatic (without router heuristic).
de: Auto-Fix: kein bekannter IPv6-Router – IPv6 für „Ethernet“ wieder auf automatisch gesetzt (ohne Router-Heuristik).

# log.ipv6test.invalidUrl
source: IPv6 test %@: ERROR – invalid URL (%@).
de: IPv6-Test %@: FEHLER – ungültige URL (%@).

# log.ipv6test.timeout
source: IPv6 test %@: ERROR – timeout after %0.0f seconds.
de: IPv6-Test %@: FEHLER – Timeout nach %0.0f Sekunden.

# log.ipv6test.httpFailed
source: IPv6 test %@: ERROR – HTTP check failed.
de: IPv6-Test %@: FEHLER – HTTP-Prüfung nicht erfolgreich.

# log.healthCheck.httpError.start
source: Health check (HTTP error): ping6 dns.google…
de: Health-Check (HTTP-Fehler): ping6 dns.google …

# log.healthCheck.httpError.result
source: Health check (HTTP error): ping6 dns.google → %@
de: Health-Check (HTTP-Fehler): ping6 dns.google → %@

# log.shell.launchError
source: Error launching %@: %@
de: Fehler beim Starten von %@: %@

# log.ping.launchError
source: Error launching /sbin/ping6: %@
de: Fehler beim Starten von /sbin/ping6: %@

# log.toggleIPv6.reset
source: Reset IPv6 mode for service '%@': OFF → AUTOMATIC.
de: IPv6-Modus für Dienst „%@“ wird zurückgesetzt: AUS → AUTOMATISCH.

# log.toggleIPv6.nowAutomatic
source: IPv6 mode for service '%@' is now AUTOMATIC (networksetup).
de: IPv6-Modus für Dienst „%@“ steht nun auf AUTOMATISCH (networksetup).

# log.netstatus.skipDuringAutoFix
source: Network status changed during auto-fix – automatic check is skipped.
de: Netzwerkstatus während Auto-Fix geändert – automatische Prüfung wird übersprungen.

# log.autoFix.skipped.ulaOnlyRecently
source: Auto-fix skipped (ULA-only case) – it was run recently.
de: Auto-Fix übersprungen (nur ULA-Adressen) – vor kurzem bereits ausgeführt.

# log.autoFix.skipped.noDefaultRouteRecently
source: Auto-fix skipped (no IPv6 default route) – it was run recently.
de: Auto-Fix übersprungen (keine IPv6-Standardroute) – vor kurzem bereits ausgeführt.

# log.autoFix.skipped.ipv6DeadRecently
source: Auto-fix skipped (IPv6 still unreachable) – it was run recently.
de: Auto-Fix übersprungen (IPv6 weiterhin nicht erreichbar) – vor kurzem bereits ausgeführt.

# log.autoFix.resetEthernetAutomatic
source: Auto-fix: renegotiating IPv6 on “Ethernet” (OFF → AUTOMATIC).
de: Auto-Fix: IPv6 auf „Ethernet“ neu ausgehandelt (AUS → AUTOMATISCH).

# log.autoFix.afterResetSummary
source: Auto-fix after reset – Ethernet IPv6 = %@, default route = %@ on %@.
de: Auto-Fix nach Reset – Ethernet IPv6 = %@, Standardroute = %@ auf %@.

# log.autoFix.noValidComboStayAutomatic
source: Auto-fix: no valid combination of IPv6 address and default route found – keeping IPv6 in automatic mode.
de: Auto-Fix: keine gültige Kombination aus IPv6-Adresse und Standardroute gefunden – IPv6 bleibt im Automatik-Modus.

# log.autoFix.setManualFromAuto
source: Auto-fix: set IPv6 for “Ethernet” to MANUAL using address %@/%@ with router %@.
de: Auto-Fix: IPv6 für „Ethernet“ manuell gesetzt mit Adresse %@/%@, Router %@.

# status.autoFix.renewedAutomatic
source: Status: IPv6 configuration renewed in automatic mode, checking again …
de: Status: IPv6-Konfiguration wurde im Automatik-Modus erneuert, Status wird erneut geprüft …

# status.autoFix.manualFromAuto
source: Status: IPv6 was set to manual on “Ethernet” based on the previous automatic configuration, checking again …
de: Status: IPv6 wurde für „Ethernet“ manuell gesetzt (basierend auf der vorherigen Auto-Konfiguration), Status wird erneut geprüft …

# log.updateCheck.start
source: Update check started (current version %@).
de: Manuelle Update-Prüfung gestartet (aktuelle Version: %@).

# log.updateCheck.noTag
source: Update check: GitHub response did not contain a usable tag_name.
de: GitHub-Antwort enthielt keine verwertbare Versionsinformation (tag_name fehlt).

# log.updateCheck.invalidUrl
source: Update check: ERROR – invalid GitHub URL (%@).
de: Update-Prüfung fehlgeschlagen: Ungültige GitHub-URL.

# log.updateCheck.invalidResponse
source: Update check: ERROR – invalid or incomplete GitHub response.
de: Update-Prüfung fehlgeschlagen: Antwortdaten von GitHub waren ungültig oder unvollständig.

# log.updateCheck.noUpdate
source: Update check: no newer version available.
de: Update-Prüfung: Es ist keine neuere Version verfügbar.

# log.updateCheck.latestVersion
source: Latest available GitHub version: %@.
de: Neueste verfügbare GitHub-Version: %@.

# updateCheck.alert.title.error
source: Update check failed
de: Update-Überprüfung fehlgeschlagen

# updateCheck.alert.message.invalidResponse
source: The GitHub response for the latest version was unexpected or incomplete. Please try again later or check the releases manually on GitHub.
de: Die Antwort von GitHub war unerwartet oder unvollständig. Bitte versuche es später erneut oder prüfe die Releases manuell auf GitHub;

# updateCheck.alert.message.noTag
source: The GitHub response for the latest version did not contain usable version information. Please check the releases manually on GitHub.
de: Die GitHub-Antwort enthielt keine verwertbare Versionsinformation. Bitte prüfe die Releases manuell auf GitHub;
